Xinyuan-LilyGO/lilygo-micropython/target/esp32/boards/LILYGO_T-CALL/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "T-CALL SIM800 (spiram)"
#define MICROPY_HW_MCU_NAME "ESP32"